<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [squid-users] &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1601;&#1610; &#1575;&#1604;&#1605;&#1594;&#1585;&#1576;
   </TITLE>
   <LINK REL="Index" HREF="index.html" >
   <LINK REL="made" HREF="mailto:squid-users%40lists.squid-cache.org?Subject=Re%3A%20%5Bsquid-users%5D%20%3D%3Futf-8%3Fb%3F2LTZh9in2K/YqSDYp9mE2KPYqNmI2Kkg2YHZiiA%3D%3F%3D%0A%20%3D%3Futf-8%3Fb%3F2KfZhNmF2LrYsdio%3F%3D&In-Reply-To=%3CCAEDhRErzEDjY_d2HchhYVhy3DrpU6WDLcNhUkZiStPsQ28azJg%40mail.gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="027636.html">
   <LINK REL="Next"  HREF="027638.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[squid-users] &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1601;&#1610; &#1575;&#1604;&#1605;&#1594;&#1585;&#1576;</H1>
    <B>walid falcon</B> 
    <A HREF="mailto:squid-users%40lists.squid-cache.org?Subject=Re%3A%20%5Bsquid-users%5D%20%3D%3Futf-8%3Fb%3F2LTZh9in2K/YqSDYp9mE2KPYqNmI2Kkg2YHZiiA%3D%3F%3D%0A%20%3D%3Futf-8%3Fb%3F2KfZhNmF2LrYsdio%3F%3D&In-Reply-To=%3CCAEDhRErzEDjY_d2HchhYVhy3DrpU6WDLcNhUkZiStPsQ28azJg%40mail.gmail.com%3E"
       TITLE="[squid-users] &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1601;&#1610; &#1575;&#1604;&#1605;&#1594;&#1585;&#1576;">pikolasikolatest2 at gmail.com
       </A><BR>
    <I>Tue Aug  5 20:11:29 UTC 2025</I>
    <P><UL>
        <LI>Previous message (by thread): <A HREF="027636.html">[squid-users] Old style - detailed Release notes
</A></li>
        <LI>Next message (by thread): <A HREF="027638.html">[squid-users] Kerberos Auth weirdness/inconsistency when using CNAMEs/Round-robin DNS
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#27637">[ date ]</a>
              <a href="thread.html#27637">[ thread ]</a>
              <a href="subject.html#27637">[ subject ]</a>
              <a href="author.html#27637">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&#1603;&#1604; &#1605;&#1575; &#1578;&#1581;&#1578;&#1575;&#1580; &#1605;&#1593;&#1585;&#1601;&#1578;&#1607; &#1581;&#1608;&#1604; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1576;&#1575;&#1604;&#1605;&#1594;&#1585;&#1576;




 &#1610;&#1605;&#1603;&#1606;&#1603; &#1578;&#1581;&#1605;&#1610;&#1604; &#1575;&#1604;&#1591;&#1604;&#1576; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1575;&#1604;&#1585;&#1575;&#1576;&#1591; &#1575;&#1604;&#1605;&#1576;&#1575;&#1588;&#1585;
<A HREF="https://www.targir.com/2025/04/blog-post_14.html">https://www.targir.com/2025/04/blog-post_14.html</A>



&#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; &#1588;&#1575;&#1605;&#1604;&#1577; &#1604;&#1575;&#1587;&#1578;&#1582;&#1585;&#1575;&#1580; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1608;&#1575;&#1604;&#1573;&#1580;&#1585;&#1575;&#1569;&#1575;&#1578; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1575;&#1604;&#1605;&#1585;&#1578;&#1576;&#1591;&#1577; &#1576;&#1607;&#1575;




&#1605;&#1575; &#1607;&#1610; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1601;&#1610; &#1575;&#1604;&#1605;&#1594;&#1585;&#1576;&#1567;




&#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1608;&#1579;&#1610;&#1602;&#1577; &#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1578;&#1589;&#1583;&#1585; &#1576;&#1606;&#1575;&#1569;&#1611; &#1593;&#1604;&#1609; &#1581;&#1603;&#1605; &#1602;&#1590;&#1575;&#1574;&#1610;&#1548; &#1608;&#1578;&#1615;&#1579;&#1576;&#1578; &#1575;&#1604;&#1593;&#1604;&#1575;&#1602;&#1577; &#1575;&#1604;&#1576;&#1606;&#1608;&#1610;&#1577;
&#1576;&#1610;&#1606; &#1575;&#1604;&#1591;&#1601;&#1604; &#1608;&#1608;&#1575;&#1604;&#1583;&#1607; &#1575;&#1604;&#1576;&#1610;&#1608;&#1604;&#1608;&#1580;&#1610;&#1548; &#1601;&#1610; &#1581;&#1575;&#1604; &#1593;&#1583;&#1605; &#1608;&#1580;&#1608;&#1583; &#1593;&#1602;&#1583; &#1586;&#1608;&#1575;&#1580; &#1585;&#1587;&#1605;&#1610; &#1571;&#1608; &#1578;&#1587;&#1580;&#1610;&#1604; &#1587;&#1575;&#1576;&#1602;.
&#1578;&#1615;&#1593;&#1614;&#1583; &#1607;&#1584;&#1607; &#1575;&#1604;&#1588;&#1607;&#1575;&#1583;&#1577; &#1580;&#1586;&#1569;&#1611;&#1575; &#1605;&#1606; &#1575;&#1604;&#1573;&#1580;&#1585;&#1575;&#1569;&#1575;&#1578; &#1575;&#1604;&#1602;&#1590;&#1575;&#1574;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1583;&#1582;&#1604; &#1590;&#1605;&#1606; &#1602;&#1590;&#1575;&#1610;&#1575; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577;
&#1575;&#1604;&#1605;&#1583;&#1606;&#1610;&#1577;.




&#1575;&#1604;&#1581;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1578;&#1587;&#1578;&#1608;&#1580;&#1576; &#1575;&#1587;&#1578;&#1582;&#1585;&#1575;&#1580; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;
1. &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; &#1594;&#1610;&#1585; &#1575;&#1604;&#1605;&#1587;&#1580;&#1604;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577; &#1575;&#1604;&#1605;&#1583;&#1606;&#1610;&#1577;
&#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1608;&#1604;&#1583; &#1591;&#1601;&#1604; &#1582;&#1575;&#1585;&#1580; &#1573;&#1591;&#1575;&#1585; &#1575;&#1604;&#1586;&#1608;&#1575;&#1580; &#1571;&#1608; &#1604;&#1605; &#1610;&#1615;&#1587;&#1580;&#1617;&#1614;&#1604; &#1576;&#1589;&#1601;&#1577; &#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1601;&#1610; &#1583;&#1601;&#1578;&#1585; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577;
&#1575;&#1604;&#1605;&#1583;&#1606;&#1610;&#1577;&#1548; &#1610;&#1581;&#1578;&#1575;&#1580; &#1575;&#1604;&#1571;&#1576; &#1573;&#1604;&#1609; &#1585;&#1601;&#1593; &#1583;&#1593;&#1608;&#1609; &#1604;&#1604;&#1581;&#1589;&#1608;&#1604; &#1593;&#1604;&#1609; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;.




2. &#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1606;&#1587;&#1576; &#1601;&#1610; &#1594;&#1610;&#1575;&#1576; &#1593;&#1602;&#1583; &#1586;&#1608;&#1575;&#1580;
&#1601;&#1610; &#1581;&#1575;&#1604;&#1575;&#1578; &#1593;&#1583;&#1605; &#1578;&#1608;&#1601;&#1585; &#1608;&#1579;&#1610;&#1602;&#1577; &#1575;&#1604;&#1586;&#1608;&#1575;&#1580; &#1576;&#1610;&#1606; &#1575;&#1604;&#1571;&#1576;&#1608;&#1610;&#1606;&#1548; &#1610;&#1615;&#1604;&#1580;&#1571; &#1573;&#1604;&#1609; &#1575;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577; &#1604;&#1578;&#1602;&#1583;&#1610;&#1605;
&#1575;&#1604;&#1578;&#1589;&#1585;&#1610;&#1581; &#1576;&#1575;&#1604;&#1571;&#1576;&#1608;&#1577;.




&#1573;&#1580;&#1585;&#1575;&#1569;&#1575;&#1578; &#1575;&#1604;&#1581;&#1589;&#1608;&#1604; &#1593;&#1604;&#1609; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;
&#1571;&#1608;&#1604;&#1575;: &#1585;&#1601;&#1593; &#1583;&#1593;&#1608;&#1609; &#1571;&#1605;&#1575;&#1605; &#1575;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577;
&#1610;&#1578;&#1608;&#1580;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1571;&#1576; &#1571;&#1608; &#1608;&#1604;&#1610; &#1571;&#1605;&#1585; &#1575;&#1604;&#1591;&#1601;&#1604; &#1578;&#1602;&#1583;&#1610;&#1605; &#1591;&#1604;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577; &#1575;&#1604;&#1575;&#1576;&#1578;&#1583;&#1575;&#1574;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1610;&#1602;&#1593;
&#1601;&#1610;&#1607;&#1575; &#1605;&#1602;&#1585; &#1587;&#1603;&#1606; &#1575;&#1604;&#1591;&#1601;&#1604; &#1571;&#1608; &#1575;&#1604;&#1571;&#1576;&#1548; &#1608;&#1584;&#1604;&#1603; &#1605;&#1606; &#1571;&#1580;&#1604; &#1573;&#1589;&#1583;&#1575;&#1585; &#1581;&#1603;&#1605; &#1602;&#1590;&#1575;&#1574;&#1610; &#1576;&#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;.




&#1579;&#1575;&#1606;&#1610;&#1575;&#1611;: &#1575;&#1604;&#1608;&#1579;&#1575;&#1574;&#1602; &#1575;&#1604;&#1605;&#1591;&#1604;&#1608;&#1576;&#1577;
&#1606;&#1587;&#1582;&#1577; &#1605;&#1606; &#1576;&#1591;&#1575;&#1602;&#1577; &#1575;&#1604;&#1578;&#1593;&#1585;&#1610;&#1601; &#1575;&#1604;&#1608;&#1591;&#1606;&#1610;&#1577;
&#1593;&#1602;&#1583; &#1575;&#1604;&#1575;&#1586;&#1583;&#1610;&#1575;&#1583; &#1575;&#1604;&#1582;&#1575;&#1589; &#1576;&#1575;&#1604;&#1591;&#1601;&#1604; (&#1573;&#1606; &#1608;&#1615;&#1580;&#1583;)
&#1588;&#1607;&#1575;&#1583;&#1577; &#1591;&#1576;&#1610;&#1577; &#1604;&#1604;&#1608;&#1604;&#1575;&#1583;&#1577;
&#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1587;&#1603;&#1606;&#1609;
&#1608;&#1579;&#1575;&#1574;&#1602; &#1571;&#1608; &#1573;&#1579;&#1576;&#1575;&#1578;&#1575;&#1578; &#1578;&#1583;&#1593;&#1605; &#1593;&#1604;&#1575;&#1602;&#1577; &#1575;&#1604;&#1571;&#1576; &#1576;&#1575;&#1604;&#1591;&#1601;&#1604;
&#1606;&#1605;&#1608;&#1584;&#1580; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; pdf
&#1578;&#1578;&#1610;&#1581; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1608;&#1575;&#1602;&#1593; &#1575;&#1604;&#1573;&#1604;&#1603;&#1578;&#1585;&#1608;&#1606;&#1610;&#1577; &#1578;&#1581;&#1605;&#1610;&#1604; &#1606;&#1605;&#1608;&#1584;&#1580; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; PDF &#1602;&#1575;&#1576;&#1604; &#1604;&#1604;&#1591;&#1576;&#1575;&#1593;&#1577;&#1548; &#1594;&#1610;&#1585;
&#1571;&#1606; &#1573;&#1589;&#1583;&#1575;&#1585;&#1607;&#1575; &#1575;&#1604;&#1585;&#1587;&#1605;&#1610; &#1604;&#1575; &#1610;&#1578;&#1605; &#1573;&#1604;&#1575; &#1576;&#1593;&#1583; &#1581;&#1603;&#1605; &#1602;&#1590;&#1575;&#1574;&#1610;&#1548; &#1608;&#1610;&#1578;&#1605; &#1578;&#1608;&#1580;&#1610;&#1607;&#1607;&#1575; &#1604;&#1605;&#1589;&#1604;&#1581;&#1577; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577;
&#1575;&#1604;&#1605;&#1583;&#1606;&#1610;&#1577; &#1604;&#1578;&#1587;&#1580;&#1610;&#1604; &#1575;&#1604;&#1591;&#1601;&#1604;.




&#1575;&#1604;&#1571;&#1587;&#1574;&#1604;&#1577; &#1575;&#1604;&#1588;&#1575;&#1574;&#1593;&#1577; &#1581;&#1608;&#1604; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;
&#1607;&#1604; &#1610;&#1605;&#1603;&#1606; &#1578;&#1602;&#1583;&#1610;&#1605; &#1591;&#1604;&#1576; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1573;&#1604;&#1603;&#1578;&#1585;&#1608;&#1606;&#1610;&#1575;&#1611;&#1567;
&#1604;&#1575;&#1548; &#1575;&#1604;&#1605;&#1587;&#1591;&#1585;&#1577; &#1578;&#1592;&#1604; &#1602;&#1590;&#1575;&#1574;&#1610;&#1577; &#1608;&#1578;&#1578;&#1591;&#1604;&#1576; &#1575;&#1604;&#1581;&#1590;&#1608;&#1585; &#1571;&#1605;&#1575;&#1605; &#1575;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577;.




&#1605;&#1575; &#1607;&#1610; &#1605;&#1583;&#1577; &#1575;&#1604;&#1581;&#1589;&#1608;&#1604; &#1593;&#1604;&#1609; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;&#1567;
&#1602;&#1583; &#1578;&#1582;&#1578;&#1604;&#1601; &#1575;&#1604;&#1605;&#1583;&#1577; &#1581;&#1587;&#1576; &#1593;&#1583;&#1583; &#1575;&#1604;&#1580;&#1604;&#1587;&#1575;&#1578;&#1548; &#1608;&#1604;&#1603;&#1606; &#1593;&#1575;&#1583;&#1577; &#1605;&#1575; &#1578;&#1587;&#1578;&#1594;&#1585;&#1602; &#1576;&#1610;&#1606; &#1588;&#1607;&#1585; &#1573;&#1604;&#1609; &#1579;&#1604;&#1575;&#1579;&#1577; &#1571;&#1588;&#1607;&#1585;&#1548;
&#1581;&#1587;&#1576; &#1578;&#1593;&#1602;&#1610;&#1583; &#1575;&#1604;&#1605;&#1604;&#1601;.




&#1589;&#1604;&#1577; &#1576;&#1610;&#1606; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1608;&#1576;&#1593;&#1590; &#1575;&#1604;&#1578;&#1589;&#1575;&#1585;&#1610;&#1581; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609;
&#1578;&#1605; &#1575;&#1604;&#1585;&#1576;&#1591; &#1590;&#1605;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1583;&#1604;&#1610;&#1604; &#1576;&#1610;&#1606; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1608;&#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1601;&#1575;&#1607;&#1610;&#1605; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609;
&#1575;&#1604;&#1578;&#1610; &#1610;&#1576;&#1581;&#1579; &#1593;&#1606;&#1607;&#1575; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585;&#1548; &#1605;&#1579;&#1604;:




1. &#1575;&#1604;&#1578;&#1589;&#1585;&#1610;&#1581; &#1575;&#1604;&#1571;&#1605;&#1606;&#1610; &#1608;&#1578;&#1589;&#1585;&#1610;&#1581; &#1575;&#1604;&#1587;&#1601;&#1585;
&#1594;&#1575;&#1604;&#1576;&#1575;&#1611; &#1605;&#1575; &#1610;&#1615;&#1591;&#1604;&#1576; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1581;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1578;&#1608;&#1601;&#1610;&#1585; &#1578;&#1589;&#1585;&#1610;&#1581; &#1571;&#1605;&#1606;&#1610; &#1593;&#1606;&#1583; &#1575;&#1587;&#1578;&#1582;&#1585;&#1575;&#1580; &#1571;&#1608;&#1585;&#1575;&#1602;
&#1579;&#1576;&#1608;&#1578;&#1610;&#1577;&#1548; &#1603;&#1605;&#1575; &#1607;&#1608; &#1575;&#1604;&#1581;&#1575;&#1604; &#1601;&#1610;:




&#1575;&#1604;&#1571;&#1608;&#1585;&#1575;&#1602; &#1575;&#1604;&#1605;&#1591;&#1604;&#1608;&#1576;&#1577; &#1604;&#1575;&#1587;&#1578;&#1582;&#1585;&#1575;&#1580; &#1578;&#1589;&#1585;&#1610;&#1581; &#1575;&#1604;&#1587;&#1601;&#1585; &#1605;&#1606; &#1605;&#1606;&#1591;&#1602;&#1577; &#1575;&#1604;&#1578;&#1580;&#1606;&#1610;&#1583;
&#1578;&#1589;&#1585;&#1610;&#1581; &#1571;&#1605;&#1606;&#1610; &#1605;&#1587;&#1578;&#1593;&#1580;&#1604;
&#1575;&#1604;&#1578;&#1589;&#1585;&#1610;&#1581; &#1575;&#1604;&#1571;&#1605;&#1606;&#1610; &#1575;&#1604;&#1573;&#1604;&#1603;&#1578;&#1585;&#1608;&#1606;&#1610;
2. &#1575;&#1587;&#1578;&#1576;&#1583;&#1575;&#1604; &#1575;&#1604;&#1578;&#1589;&#1585;&#1610;&#1581; &#1576;&#1585;&#1582;&#1589;&#1577; &#1602;&#1610;&#1575;&#1583;&#1577;
&#1601;&#1610; &#1581;&#1575;&#1604;&#1575;&#1578; &#1605;&#1579;&#1604; &#1588;&#1585;&#1608;&#1591; &#1573;&#1589;&#1583;&#1575;&#1585; &#1585;&#1582;&#1589;&#1577; &#1602;&#1610;&#1575;&#1583;&#1577; &#1576;&#1593;&#1583; &#1575;&#1604;&#1578;&#1589;&#1585;&#1610;&#1581; &#1571;&#1608; &#1578;&#1580;&#1583;&#1610;&#1583; &#1575;&#1604;&#1578;&#1589;&#1585;&#1610;&#1581; &#1573;&#1604;&#1609; &#1585;&#1582;&#1589;&#1577;&#1548;
&#1605;&#1606; &#1575;&#1604;&#1605;&#1607;&#1605; &#1575;&#1604;&#1578;&#1571;&#1603;&#1583; &#1605;&#1606; &#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1607;&#1608;&#1610;&#1577; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577;&#1548; &#1608;&#1607;&#1608; &#1605;&#1575; &#1610;&#1580;&#1593;&#1604; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1590;&#1585;&#1608;&#1585;&#1610;&#1577;
&#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1581;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1575;&#1604;&#1582;&#1575;&#1589;&#1577;.




&#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577;
&#1575;&#1604;&#1594;&#1575;&#1610;&#1577; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1608;&#1579;&#1610;&#1602;&#1577; &#1607;&#1610; &#1573;&#1579;&#1576;&#1575;&#1578; &#1593;&#1604;&#1575;&#1602;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1576;&#1575;&#1604;&#1575;&#1576;&#1606; &#1587;&#1608;&#1575;&#1569; &#1603;&#1575;&#1606; &#1585;&#1575;&#1588;&#1583;&#1575; &#1571;&#1605; &#1602;&#1575;&#1589;&#1585;&#1575;
&#1608;&#1594;&#1575;&#1604;&#1576;&#1575; &#1605;&#1575; &#1578;&#1591;&#1604;&#1576; &#1601;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1587;&#1575;&#1591;&#1585; &#1575;&#1604;&#1573;&#1583;&#1575;&#1585;&#1610;&#1577;.




&#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1591;&#1604;&#1576;
&#1575;&#1604;&#1605;&#1594;&#1585;&#1576;&#1610; &#1575;&#1604;&#1605;&#1602;&#1610;&#1605; &#1576;&#1575;&#1604;&#1582;&#1575;&#1585;&#1580;




&#1575;&#1604;&#1608;&#1579;&#1575;&#1574;&#1602; &#1575;&#1604;&#1605;&#1591;&#1604;&#1608;&#1576;&#1577;
&#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1604;&#1585;&#1575;&#1588;&#1583; :




&#183;       &#1576;&#1591;&#1575;&#1602;&#1577; &#1575;&#1604;&#1578;&#1587;&#1580;&#1610;&#1604; &#1563;




&#183;       &#1575;&#1604;&#1583;&#1601;&#1578;&#1585; &#1575;&#1604;&#1593;&#1575;&#1574;&#1604;&#1610;




&#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1604;&#1602;&#1575;&#1589;&#1585; :




&#183;       &#1576;&#1591;&#1575;&#1602;&#1577; &#1578;&#1587;&#1580;&#1610;&#1604; &#1575;&#1604;&#1571;&#1576; &#1563;




&#183;       &#1575;&#1604;&#1583;&#1601;&#1578;&#1585; &#1575;&#1604;&#1593;&#1575;&#1574;&#1604;&#1610; .




&#1575;&#1604;&#1605;&#1589;&#1604;&#1581;&#1577; &#1575;&#1604;&#1605;&#1603;&#1604;&#1601;&#1577; &#1576;&#1575;&#1587;&#1578;&#1604;&#1575;&#1605; &#1575;&#1604;&#1608;&#1579;&#1575;&#1574;&#1602; &#1575;&#1604;&#1605;&#1591;&#1604;&#1608;&#1576;&#1577;
&#1575;&#1604;&#1605;&#1589;&#1575;&#1604;&#1581; &#1575;&#1604;&#1602;&#1606;&#1589;&#1604;&#1610;&#1577; &#1575;&#1604;&#1578;&#1575;&#1576;&#1593;&#1577; &#1604;&#1605;&#1581;&#1604; &#1573;&#1602;&#1575;&#1605;&#1577; &#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1591;&#1604;&#1576;




&#1575;&#1604;&#1605;&#1589;&#1604;&#1581;&#1577; &#1575;&#1604;&#1605;&#1603;&#1604;&#1601;&#1577; &#1576;&#1578;&#1602;&#1583;&#1610;&#1605; &#1575;&#1604;&#1582;&#1583;&#1605;&#1577;
&#1575;&#1604;&#1605;&#1589;&#1575;&#1604;&#1581; &#1575;&#1604;&#1602;&#1606;&#1589;&#1604;&#1610;&#1577; &#1575;&#1604;&#1578;&#1575;&#1576;&#1593;&#1577; &#1604;&#1605;&#1581;&#1604; &#1573;&#1602;&#1575;&#1605;&#1577; &#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1591;&#1604;&#1576;




&#1601;&#1610; &#1581;&#1575;&#1604;&#1577; &#1578;&#1593;&#1584;&#1585; &#1575;&#1604;&#1581;&#1589;&#1608;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1582;&#1583;&#1605;&#1577;
&#1605;&#1572;&#1587;&#1587;&#1577; &#1575;&#1604;&#1608;&#1587;&#1610;&#1591;




&#1604;&#1571;&#1580;&#1604; &#1575;&#1604;&#1575;&#1578;&#1589;&#1575;&#1604;
&#1608;&#1586;&#1575;&#1585;&#1577; &#1575;&#1604;&#1588;&#1572;&#1608;&#1606; &#1575;&#1604;&#1582;&#1575;&#1585;&#1580;&#1610;&#1577; &#1608;&#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606;




&#1605;&#1589;&#1583;&#1585; &#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605;&#1575;&#1578; (&#1575;&#1604;&#1573;&#1583;&#1575;&#1585;&#1577; &#1575;&#1604;&#1605;&#1593;&#1606;&#1610;&#1577;)
&#1608;&#1586;&#1575;&#1585;&#1577; &#1575;&#1604;&#1588;&#1572;&#1608;&#1606; &#1575;&#1604;&#1582;&#1575;&#1585;&#1580;&#1610;&#1577; &#1608;&#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606;_&#1571;&#1585;&#1588;&#1610;&#1601;




&#1610;&#1605;&#1603;&#1606;&#1603; &#1578;&#1581;&#1605;&#1610;&#1604; &#1575;&#1604;&#1591;&#1604;&#1576; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1575;&#1604;&#1585;&#1575;&#1576;&#1591; &#1575;&#1604;&#1605;&#1576;&#1575;&#1588;&#1585;




&#1606;&#1605;&#1608;&#1584;&#1580; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;&#1608;&#1577; &#1576;&#1575;&#1604;&#1605;&#1594;&#1585;&#1576;
&#1605;&#1581;&#1603;&#1605;&#1577; &#1575;&#1604;&#1571;&#1587;&#1585;&#1577; &#1576;&#1600;: [&#1575;&#1587;&#1605; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577;]
&#1585;&#1602;&#1605; &#1575;&#1604;&#1605;&#1604;&#1601;: [&#1610;&#1615;&#1578;&#1585;&#1603; &#1604;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577;]
&#1585;&#1602;&#1605; &#1575;&#1604;&#1602;&#1590;&#1610;&#1577;: [&#1610;&#1615;&#1578;&#1585;&#1603; &#1604;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577;]




&#1576;&#1610;&#1575;&#1606; &#1578;&#1589;&#1585;&#1610;&#1581; &#1576;&#1575;&#1604;&#1571;&#1576;&#1608;&#1577;
&#1571;&#1606;&#1575; &#1575;&#1604;&#1605;&#1608;&#1602;&#1593; &#1571;&#1587;&#1601;&#1604;&#1607;:




&#1575;&#1604;&#1575;&#1587;&#1605; &#1575;&#1604;&#1603;&#1575;&#1605;&#1604;: [&#1575;&#1604;&#1575;&#1587;&#1605; &#1575;&#1604;&#1603;&#1575;&#1605;&#1604; &#1604;&#1604;&#1571;&#1576;]




&#1585;&#1602;&#1605; &#1576;&#1591;&#1575;&#1602;&#1577; &#1575;&#1604;&#1578;&#1593;&#1585;&#1610;&#1601; &#1575;&#1604;&#1608;&#1591;&#1606;&#1610;&#1577;: [&#1585;&#1602;&#1605; CIN]




&#1578;&#1575;&#1585;&#1610;&#1582; &#1608;&#1605;&#1603;&#1575;&#1606; &#1575;&#1604;&#1575;&#1586;&#1583;&#1610;&#1575;&#1583;: [&#1578;&#1575;&#1585;&#1610;&#1582; &#1608;&#1605;&#1603;&#1575;&#1606; &#1608;&#1604;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1576;]




&#1575;&#1604;&#1593;&#1606;&#1608;&#1575;&#1606; &#1575;&#1604;&#1603;&#1575;&#1605;&#1604;: [&#1593;&#1606;&#1608;&#1575;&#1606; &#1575;&#1604;&#1573;&#1602;&#1575;&#1605;&#1577;]




&#1575;&#1604;&#1605;&#1607;&#1606;&#1577;: [&#1575;&#1604;&#1605;&#1607;&#1606;&#1577; &#1575;&#1604;&#1581;&#1575;&#1604;&#1610;&#1577;]




&#1571;&#1615;&#1589;&#1585;&#1617;&#1581; &#1576;&#1605;&#1608;&#1580;&#1576; &#1607;&#1584;&#1575;&#1548; &#1608;&#1576;&#1603;&#1575;&#1605;&#1604; &#1602;&#1608;&#1575;&#1610; &#1575;&#1604;&#1593;&#1602;&#1604;&#1610;&#1577; &#1608;&#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577;&#1548; &#1576;&#1605;&#1575; &#1610;&#1604;&#1610;:




&#1571;&#1606; &#1575;&#1604;&#1591;&#1601;&#1604; (&#1577;) &#1575;&#1604;&#1605;&#1587;&#1605;&#1609; (&#1577;): [&#1575;&#1587;&#1605; &#1575;&#1604;&#1591;&#1601;&#1604;/&#1577;]
&#1575;&#1604;&#1605;&#1608;&#1604;&#1608;&#1583; (&#1577;) &#1576;&#1578;&#1575;&#1585;&#1610;&#1582;: [&#1578;&#1575;&#1585;&#1610;&#1582; &#1575;&#1604;&#1608;&#1604;&#1575;&#1583;&#1577;]
&#1576;&#1600;: [&#1605;&#1603;&#1575;&#1606; &#1575;&#1604;&#1608;&#1604;&#1575;&#1583;&#1577;]




&#1607;&#1608;(&#1607;&#1610;) &#1575;&#1576;&#1606;&#1610;/&#1575;&#1576;&#1606;&#1578;&#1610; &#1575;&#1604;&#1576;&#1610;&#1608;&#1604;&#1608;&#1580;&#1610;(&#1577;)&#1548; &#1608;&#1602;&#1583; &#1608;&#1615;&#1604;&#1583;(&#1578;) &#1606;&#1578;&#1610;&#1580;&#1577; &#1593;&#1604;&#1575;&#1602;&#1577; &#1571;&#1576;&#1608;&#1610;&#1577; &#1602;&#1575;&#1574;&#1605;&#1577; &#1576;&#1610;&#1606;&#1610;
&#1608;&#1576;&#1610;&#1606; &#1575;&#1604;&#1587;&#1610;&#1583;&#1577;:
[&#1575;&#1587;&#1605; &#1575;&#1604;&#1571;&#1605;]&#1548; &#1575;&#1604;&#1605;&#1608;&#1604;&#1608;&#1583;&#1577; &#1576;&#1578;&#1575;&#1585;&#1610;&#1582;: [&#1578;&#1575;&#1585;&#1610;&#1582; &#1605;&#1610;&#1604;&#1575;&#1583; &#1575;&#1604;&#1571;&#1605;]&#1548; &#1608;&#1575;&#1604;&#1581;&#1575;&#1605;&#1604;&#1577; &#1604;&#1585;&#1602;&#1605; &#1576;&#1591;&#1575;&#1602;&#1577;
&#1575;&#1604;&#1578;&#1593;&#1585;&#1610;&#1601; &#1575;&#1604;&#1608;&#1591;&#1606;&#1610;&#1577;: [&#1585;&#1602;&#1605; CIN &#1575;&#1604;&#1571;&#1605;].




&#1608;&#1571;&#1578;&#1581;&#1605;&#1604; &#1603;&#1575;&#1605;&#1604; &#1575;&#1604;&#1605;&#1587;&#1572;&#1608;&#1604;&#1610;&#1577; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610;&#1577; &#1608;&#1575;&#1604;&#1571;&#1576;&#1608;&#1610;&#1577; &#1578;&#1580;&#1575;&#1607; &#1607;&#1584;&#1575; &#1575;&#1604;&#1591;&#1601;&#1604;/&#1577;&#1548; &#1608;&#1571;&#1591;&#1604;&#1576; &#1605;&#1606; &#1575;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577;
&#1575;&#1604;&#1605;&#1608;&#1602;&#1585;&#1577; &#1573;&#1589;&#1583;&#1575;&#1585; &#1581;&#1603;&#1605; &#1602;&#1590;&#1575;&#1574;&#1610; &#1610;&#1579;&#1576;&#1578; &#1606;&#1587;&#1576; &#1575;&#1604;&#1591;&#1601;&#1604; &#1604;&#1610;&#1548; &#1608;&#1578;&#1605;&#1603;&#1610;&#1606;&#1607; &#1605;&#1606; &#1575;&#1604;&#1578;&#1587;&#1580;&#1610;&#1604; &#1601;&#1610; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577;
&#1575;&#1604;&#1605;&#1583;&#1606;&#1610;&#1577;.


&#1575;&#1604;&#1573;&#1605;&#1590;&#1575;&#1569;
&#1575;&#1604;&#1573;&#1587;&#1605; &#1575;&#1604;&#1603;&#1575;&#1605;&#1604;: _____________________
&#1575;&#1604;&#1578;&#1608;&#1602;&#1610;&#1593;: ___________________________
&#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582;: ____ / ____ / ________

&#1605;&#1604;&#1575;&#1581;&#1592;&#1575;&#1578; :
&#1610;&#1615;&#1585;&#1601;&#1602; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1605;&#1608;&#1584;&#1580; &#1576;&#1575;&#1604;&#1608;&#1579;&#1575;&#1574;&#1602; &#1575;&#1604;&#1583;&#1575;&#1593;&#1605;&#1577; &#1603;&#1600;: &#1606;&#1587;&#1582;&#1577; &#1575;&#1604;&#1576;&#1591;&#1575;&#1602;&#1577; &#1575;&#1604;&#1608;&#1591;&#1606;&#1610;&#1577;&#1548; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1587;&#1603;&#1606;&#1609;&#1548;
&#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1608;&#1604;&#1575;&#1583;&#1577;&#1548; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575;.
&#1610;&#1615;&#1608;&#1583;&#1614;&#1593; &#1604;&#1583;&#1609; &#1603;&#1578;&#1575;&#1576;&#1577; &#1590;&#1576;&#1591; &#1575;&#1604;&#1605;&#1581;&#1603;&#1605;&#1577; &#1575;&#1604;&#1575;&#1576;&#1578;&#1583;&#1575;&#1574;&#1610;&#1577; (&#1602;&#1587;&#1605; &#1602;&#1590;&#1575;&#1569; &#1575;&#1604;&#1571;&#1587;&#1585;&#1577;) &#1575;&#1604;&#1578;&#1610; &#1610;&#1602;&#1593; &#1590;&#1605;&#1606;
&#1575;&#1582;&#1578;&#1589;&#1575;&#1589;&#1607;&#1575; &#1605;&#1581;&#1604; &#1608;&#1604;&#1575;&#1583;&#1577; &#1575;&#1604;&#1591;&#1601;&#1604; &#1571;&#1608; &#1605;&#1581;&#1604; &#1587;&#1603;&#1606; &#1575;&#1604;&#1571;&#1576;.
-------------- next part --------------
An HTML attachment was scrubbed...
URL: &lt;<A HREF="http://lists.squid-cache.org/pipermail/squid-users/attachments/20250805/9544b5cb/attachment.htm">http://lists.squid-cache.org/pipermail/squid-users/attachments/20250805/9544b5cb/attachment.htm</A>&gt;
</PRE>


<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message (by thread): <A HREF="027636.html">[squid-users] Old style - detailed Release notes
</A></li>
	<LI>Next message (by thread): <A HREF="027638.html">[squid-users] Kerberos Auth weirdness/inconsistency when using CNAMEs/Round-robin DNS
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#27637">[ date ]</a>
              <a href="thread.html#27637">[ thread ]</a>
              <a href="subject.html#27637">[ subject ]</a>
              <a href="author.html#27637">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.squid-cache.org/listinfo/squid-users">More information about the squid-users
mailing list</a><br>
</body></html>
